const quizData = {
  "Атака титанов": {
    emoji: "⚔️",
    color: "#EC5C7D",
    questions: {
      10: {
        image: "images/aot-10.jpg",
        q: "Какой чай любит пить Леви Аккерман?",
        options: [
          "черный",
          "зеленый",
          "черный с сахаром и молоком",
          "зеленый с сахаром",
        ],
        answer: 0,
        comment:
          'Леви предпочитает черный чай, ему особенно нравится "Эрл Грей"',
      },
      20: {
        image: "images/aot-20.jpg",
        q: "Когда была опубликована первая манга по Атаке титанов?",
        options: ["07.07.2007", "08.08.2008", "09.09.2009", "10.10.2010"],
        answer: 2,
        comment: "Это идеально совпадает с 9 Основными Титанами",
      },
      30: {
        image: "images/aot-30.jpg",
        q: "С кем у Атаки титанов был официальный кроссовер?",
        options: [
          "с Мстителями",
          "с Дэдпулом",
          "с Людьми Икс",
          "с Лигой справедливости",
        ],
        answer: 0,
        comment: 'Кроссовер называется "Attack on Avengers"',
      },
      40: {
        image: "images/aot-40.jpg",
        q: "Какой реальный город вдохновил создателей на облик города Сигансина?",
        options: [
          "Каркассон, Франция",
          "Нёрдлинген, Германия",
          "Сиена, Италия",
          "Толедо, Испания",
        ],
        answer: 1,
        comment:
          "Сигансина списана с Нёрдлингена – средневекового города в Баварии, окруженного уцелевшими крепостными стенами",
      },
      50: {
        image: "images/aot-50.jpg",
        q: 'Исследуя память отца, Эрен видел малыша Зика, которого родители с самого детства готовили к "великой миссии". С какой игрушкой он изображен на одном из кадров?',
        options: [
          "с плюшевым медведем",
          "с игрушечной обезьяной",
          "с деревянной лошадкой",
          "с игрушечным солдатиком",
        ],
        answer: 1,
        comment:
          "Игрушечная обезьяна сильно напоминает его будущую форму Звероподобного титана",
      },
    },
  },
  Сумерки: {
    emoji: "🧛",
    color: "#6C72E1",
    questions: {
      10: {
        image: "images/twi-10.jpg",
        q: "Сколько Эдварду на самом деле лет в первой части?",
        options: ["87", "104", "118", "134"],
        answer: 1,
        comment:
          "Эдвард родился в 1901 году, время действия первого фильма – 2005 год",
      },
      20: {
        image: "images/twi-20.jpg",
        q: "Когда Джейкобу делают поддельные документы для новой личности, какую фамилию ему выбирают?",
        options: [
          "Вулф (Wolfe)",
          "Блэк (Black)",
          "Грей (Grey)",
          "Уайльд (Wilde)",
        ],
        answer: 0,
        comment: 'Забавно, что ему дали фамилию, которая звучит как "волк"',
      },
      30: {
        image: "images/twi-30.jpg",
        q: "Какую книгу любит Белла?",
        options: [
          "Унесенные ветром",
          "Ромео и Джульетта",
          "Грозовой перевал",
          "Гордость и предубеждение",
        ],
        answer: 2,
        comment: 'Белла обожает перечитывать "Грозовой перевал" Эмили Бронте',
      },
      40: {
        image: "images/twi-40.jpg",
        q: "В фильмах у Калленов есть фамильный герб, которого нет в книгах. Что на нем изображено?",
        options: [
          "орел, меч и роза",
          "волк, луна и щит",
          "лев, корона и крест",
          "лев, рука и трилистник",
        ],
        answer: 3,
        comment:
          "На гербе Калленов лев означает силу, рука – верность, а трилистник-клевер – бессмертие",
      },
      50: {
        image: "images/twi-50.jpg",
        q: "В столовой из первого фильма висят флаги стран, которые уже не существуют. Флаги каких государств там можно найти?",
        options: [
          "СССР и Чехословакия",
          "Южный Вьетнам и Югославия",
          "ГДР и Югославия",
          "СССР и Южный Вьетнам",
        ],
        answer: 1,
        comment:
          "Среди флагов – Северная Корея, Югославия и Южный Вьетнам. Последний исчез к 1975 году, так что столовую в Форксе будто не обновляли десятилетиями",
      },
    },
  },
  Сверхъестественное: {
    emoji: "👻",
    color: "#009b6e",
    questions: {
      10: {
        image: "images/sup-10.jpg",
        q: 'Все знают, что Винчестеры ездили на "импале". Но какого года выпуска она была?',
        options: ["1964 г.", "1965 г.", "1967 г.", "1968 г."],
        answer: 2,
        comment:
          "Chevrolet Impala 1967 года – практически третий главный герой сериала",
      },
      20: {
        image: "images/sup-20.jpg",
        q: 'В одной из серий Кроули обращается к Кастиэлю как к "Ангелу Четверга". С чем это связано?',
        options: [
          "так написано в Библии",
          "сериал выходил по четвергам",
          "в честь скандинавского бога грома",
          "четверг это день стирки",
        ],
        answer: 1,
        comment:
          'Сериал долгое время транслировался на канале "The CW" именно по четвергам',
      },
      30: {
        image: "images/sup-30.avif",
        q: "Под прикрытием братья Винчестеры обычно берут псевдонимы. Имена участников какой рок-группы они используют чаще всего?",
        options: ["The Rolling Stones", "Led Zeppelin", "Queen", "Pink Floyd"],
        answer: 1,
        comment:
          "Дин не раз представлялся Робертом Плантом и Джоном Бонэмом, а Сэм – Джимми Пейджем. Это любимая группа Дина",
      },
      40: {
        image: "images/sup-40.jpg",
        q: "Кто из актеров, сыгравших этих персонажей, срежиссировал больше всего эпизодов сериала?",
        options: ["Дин", "Кастиэль", "Кроули", "Гавриил"],
        answer: 3,
        comment:
          "Ричард Спейт (Гавриил) срежиссировал 11 эпизодов, а Дженсен Эклз снял 6",
      },
      50: {
        image: "images/sup-50.jpg",
        q: 'С каким мультсериалом в 2018 году у "Сверхъестественного" вышел кроссовер-эпизод?',
        options: ["Симпсоны", "Рик и Морти", "Скуби-Ду", "Гравити Фолз"],
        answer: 2,
        comment:
          'В эпизоде "Scoobynatural" Сэм, Дин и Кастиэль попадают в мультяшный мир Скуби-Ду и вместе с командой расследуют дело',
      },
    },
  },
  Клон: {
    emoji: "💃",
    color: "#F5A23D",
    questions: {
      10: {
        image: "images/clo-10.jpg",
        q: "Чему Джованна Антонелли училась по несколько часов в день ради роли Жади?",
        options: ["фламенко", "танцу живота", "игре на барабанах", "пению"],
        answer: 1,
        comment:
          "Ради роли Антонелли ежедневно занималась танцем живота с профессиональной танцовщицей из Египта",
      },
      20: {
        image: "images/clo-20.jpg",
        q: "Романтические сцены с Жади и Лукасом снимали в Atlas Studios (Марокко). Какой из этих фильмов снимали в этой же студии?",
        options: [
          "Гладиатор",
          "Индиана Джонс: В поисках утраченного ковчега",
          "Звездные войны: Скрытая угроза",
          "Джон Уик 3",
        ],
        answer: 0,
        comment: 'А еще там снимали "Мумию"',
      },
      30: {
        image: "images/clo-30.jpg",
        q: "В одной из серий Ивети продает клиентке платье, уверяя, что его носила знаменитость. Кого она называет?",
        options: ["Софи Лорен", "Соню Брагу", "Веру Фишер", "Режину Дуарте"],
        answer: 2,
        comment:
          "Ивети называет Веру Фишер – забавно, ведь саму Ивети как раз и играет Вера Фишер",
      },
      40: {
        image: "images/clo-40.jpeg",
        q: "За освещение этой темы создатели сериала получили официальную похвалу от двух американских ведомств. О какой проблеме идет речь?",
        options: [
          "наркозависимость",
          "торговля людьми",
          "межрелигиозные конфликты",
          "ВИЧ/СПИД",
        ],
        answer: 0,
        comment:
          "Сюжетная линия о наркозависимости персонажей Мел, Нанду и Лобату была показана настолько реалистично, что Федеральное бюро расследований США и Управление по борьбе с наркотиками официально наградили создателей за их антинаркотическую кампанию",
      },
      50: {
        image: "images/clo-50.jpg",
        q: "Джованна Антонелли (Жади) и Мурилу Бенисиу (Лукас) влюбились на съемках, прожили вместе несколько лет и родили сына Пьетру. Между актерами каких персонажей тоже закрутился роман прямо на площадке?",
        options: [
          "Маиза и Диогу",
          "Ивети и Зейн",
          "Латифа и Саид",
          "Зорайде и Мохаммед",
        ],
        answer: 1,
        comment:
          "Роман завязался между Верой Фишер (Ивети) и Лусиано Шафиром (Зейн)",
      },
    },
  },
};
